/*
 * Copyright (C) 2008-2009 QUALCOMM Incorporated.
 */

#include <linux/delay.h>
#include <linux/types.h>
#include <linux/i2c.h>
#include <linux/uaccess.h>
#include <linux/miscdevice.h>
#include <linux/slab.h>
#include <media/msm_camera.h>
#include <mach/board.h>
#include <mach/gpio.h>
#include <mach/camera.h>
#include <linux/clk.h>
#include <linux/wakelock.h>

static uint16_t g_usModuleVersion;	/*0: rev.4, 1: rev.5 */

/* prepare for modify PCLK*/
#define REG_PLL_MULTIPLIER_LSB_VALUE	  0x90
/* 0xA0 for PCLK=80MHz */
/* 0x90 for PCLK=72MHz */

/* prepare for modify initial gain*/
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB_VALUE	0x80

#define S5K3E2FX_REG_MODEL_ID   0x0000
#define S5K3E2FX_MODEL_ID       0x3E2F

#define S5K3E2FX_REG_MODULE_VER 0x0002

#define S5K3E2FX_DEF_MCLK		24000000

#define S5K3E2FX_QTR_SIZE_WIDTH		1296
#define S5K3E2FX_QTR_SIZE_HEIGHT	972

#define S5K3E2FX_FULL_SIZE_WIDTH	2608
#define S5K3E2FX_FULL_SIZE_HEIGHT	1960

/* AEC_FLASHING */
#define REG_GROUPED_PARAMETER_HOLD    0x0104
#define GROUPED_PARAMETER_HOLD        0x01
#define GROUPED_PARAMETER_UPDATE      0x00

/* Greenish in low light */
#define REG_MASK_CORRUPTED_FRAMES     0x0105
#define MASK                          0x01
#define NO_MASK                       0x00

/* PLL Registers */
#define REG_PRE_PLL_CLK_DIV           0x0305
#define REG_PLL_MULTIPLIER_MSB        0x0306
#define REG_PLL_MULTIPLIER_LSB        0x0307
#define REG_VT_PIX_CLK_DIV            0x0301

#define REG_CLP_SL_START              0x300C
#define REG_CLP_SL_END                0x300D
#define REG_OFF_START                 0x300E
#define REG_RMP_EN_START              0x300F
#define REG_TX_START                  0x3010
#define REG_TX_END                    0x3011
#define REG_STX_WIDTH                 0x3012
#define REG_TYPE1_AF_ENABLE           0x3130
#define DRIVER_ENABLED                0x0001
#define AUTO_START_ENABLED            0x0010
#define REG_NEW_POSITION              0x3131
#define REG_3152_RESERVED             0x3152
#define REG_315A_RESERVED             0x315A
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_MSB 0x0204
#define REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB 0x0205
#define REG_FINE_INTEGRATION_TIME         0x0200
#define REG_COARSE_INTEGRATION_TIME       0x0202
#define REG_COARSE_INTEGRATION_TIME_LSB   0x0203

/* Mode select register */
#define S5K3E2FX_REG_MODE_SELECT        0x0100
#define S5K3E2FX_MODE_SELECT_STREAM     0x01	/* start streaming */
#define S5K3E2FX_MODE_SELECT_SW_STANDBY 0x00	/* software standby */
#define S5K3E2FX_REG_SOFTWARE_RESET     0x0103
#define S5K3E2FX_SOFTWARE_RESET         0x01
#define REG_TEST_PATTERN_MODE           0x0601

/* Samsung other MSR setting*/
#define REG_301D_RESERVED             0x301D
#define REG_3028_RESERVED             0x3028
#define REG_3070_RESERVED             0x3070
#define REG_3072_RESERVED             0x3072
#define REG_301B_RESERVED             0x301B
#define REG_30BD_RESERVED             0x30BD
#define REG_30C2_RESERVED             0x30C2
#define REG_3151_RESERVED             0x3151
#define REG_3029_RESERVED             0x3029
#define REG_30BF_RESERVED             0x30BF
#define REG_3022_RESERVED             0x3022
#define REG_3019_RESERVED             0x3019
#define REG_3150_RESERVED             0x3150
#define REG_3157_RESERVED             0x3157
#define REG_3159_RESERVED             0x3159
/* LC Preview/Snapshot difference register */
#define REG_SH4CH_BLK_WIDTH_R         0x309E
#define REG_SH4CH_BLK_HEIGHT_R        0x309F
#define REG_SH4CH_STEP_X_R_MSB        0x30A0
#define REG_SH4CH_STEP_X_R_LSB        0x30A1
#define REG_SH4CH_STEP_Y_R_MSB        0x30A2
#define REG_SH4CH_STEP_Y_R_LSB        0x30A3
#define REG_SH4CH_START_BLK_CNT_X_R   0x30A4
#define REG_SH4CH_START_BLK_INT_X_R   0x30A5
#define REG_SH4CH_START_FRAC_X_R_MSB  0x30A6
#define REG_SH4CH_START_FRAC_X_R_LSB  0x30A7
#define REG_SH4CH_START_BLK_CNT_Y_R   0x30A8
#define REG_SH4CH_START_BLK_INT_Y_R   0x30A9
#define REG_SH4CH_START_FRAC_Y_R_MSB  0x30AA
#define REG_SH4CH_START_FRAC_Y_R_LSB  0x30AB
#define REG_X_ADDR_START_MSB          0x0344
#define REG_X_ADDR_START_LSB          0x0345
#define REG_Y_ADDR_START_MSB          0x0346
#define REG_Y_ADDR_START_LSB          0x0347
#define REG_X_ADDR_END_MSB            0x0348
#define REG_X_ADDR_END_LSB            0x0349
#define REG_Y_ADDR_END_MSB            0x034A
#define REG_Y_ADDR_END_LSB            0x034B

#define NUM_INIT_REG                  94
#define NUM_LC_REG                    434

struct s5k3e2fx_i2c_reg_conf {
	unsigned short waddr;
	unsigned char bdata;
};

/* Separate the EVT4/EVT5 sensor init and LC setting start */
struct s5k3e2fx_i2c_reg_conf Init_setting[2][NUM_INIT_REG] = {
/*EVT4 */
	{
	 {REG_PRE_PLL_CLK_DIV, 0x06},	/* PLL setting */
	 {REG_PLL_MULTIPLIER_MSB, 0x00},
	 {REG_PLL_MULTIPLIER_LSB, REG_PLL_MULTIPLIER_LSB_VALUE},
	 {REG_VT_PIX_CLK_DIV, 0x08},
	 {REG_VT_SYS_CLK_DIV, 0x01},
	 {REG_OP_PIX_CLK_DIV, 0x08},
	 {REG_OP_SYS_CLK_DIV, 0x01},
/* Data Format */
	 {REG_CCP_DATA_FORMAT_MSB, 0x0a},
	 {REG_CCP_DATA_FORMAT_LSB, 0x0a},
/* Preview Output Size */
	 {REG_X_OUTPUT_SIZE_MSB, 0x05},
	 {REG_X_OUTPUT_SIZE_LSB, 0x10},
	 {REG_Y_OUTPUT_SIZE_MSB, 0x03},
	 {REG_Y_OUTPUT_SIZE_LSB, 0xcc},
	 {REG_X_ADDR_START_MSB, 0x00},
	 {REG_X_ADDR_START_LSB, 0x08},
	 {REG_Y_ADDR_START_MSB, 0x00},
	 {REG_Y_ADDR_START_LSB, 0x08},
	 {REG_X_ADDR_END_MSB, 0x0a},
	 {REG_X_ADDR_END_LSB, 0x27},
	 {REG_Y_ADDR_END_MSB, 0x07},
	 {REG_Y_ADDR_END_LSB, 0x9f},
/* Frame format */
	 {REG_FRAME_LENGTH_LINES_MSB, 0x03},
	 {REG_FRAME_LENGTH_LINES_LSB, 0xe2},
	 {REG_LINE_LENGTH_PCK_MSB, 0x0a},
	 {REG_LINE_LENGTH_PCK_LSB, 0xac},
/* Preview Binning */
	 {REG_X_EVEN_INC, 0x01},
	 {REG_X_ODD_INC, 0x01},
	 {REG_Y_EVEN_INC, 0x01},
	 {REG_Y_ODD_INC, 0x03},
	 {REG_BINNING_ENABLE, 0x06},
/* Samsung MSR Setting */
	 {REG_SEL_CCP, 0x01},
	 {REG_LD_START, 0x03},
/* Add EVT5 sensor Samsung MSR setting, Start */
	 {REG_LD_END, 0x94},
	 {REG_SL_START, 0x02},
	 {REG_SL_END, 0x95},
	 {REG_RX_START, 0x0f},
	 {REG_S1_START, 0x05},
	 {REG_S1_END, 0x3c},
	 {REG_S1S_START, 0x8c},
	 {REG_S1S_END, 0x93},
	 {REG_S3_START, 0x05},
	 {REG_S3_END, 0x3a},
	 {REG_CMP_EN_START, 0x10},
	 {REG_CLP_SL_START, 0x02},
	 {REG_CLP_SL_END, 0x3e},
	 {REG_OFF_START, 0x02},
	 {REG_RMP_EN_START, 0x0e},
	 {REG_TX_START, 0x46},
	 {REG_TX_END, 0x64},
	 {REG_STX_WIDTH, 0x1e},
	 {REG_CLAMP_ON, 0x00},
	 {REG_301D_RESERVED, 0x3f},
	 {REG_VPIX, 0x04},
	 {REG_3028_RESERVED, 0x40},
	 {REG_3070_RESERVED, 0xdf},
	 {REG_3072_RESERVED, 0x20},
	 {REG_301B_RESERVED, 0x73},
	 {REG_OFFSET, 0x02},
	 {REG_30BD_RESERVED, 0x06},
	 {REG_30C2_RESERVED, 0x0b},
	 {REG_SHADE_CLK_ENABLE, 0x81},
	 {REG_3151_RESERVED, 0xe6},
	 {REG_3029_RESERVED, 0x02},
	 {REG_30BF_RESERVED, 0x00},
	 {REG_3022_RESERVED, 0x87},
	 {REG_3019_RESERVED, 0x60},
	 {REG_3019_RESERVED, 0x60},
	 {REG_3019_RESERVED, 0x60},
	 {REG_3019_RESERVED, 0x60},
	 {REG_3019_RESERVED, 0x60},
	 {REG_3019_RESERVED, 0x60},
	 {REG_3152_RESERVED, 0x08},
	 {REG_3150_RESERVED, 0x50}, /* from 0x40 to 0x50 for PCLK=80MHz */
/* Inverse PCLK = 0x50 */
	 {REG_3157_RESERVED, 0x04}, /* from 0x00 to 0x04 for PCLK=80MHz */
/* PCLK Delay offset; 0x0a will delay around 4ns at 80MHz */
	 {REG_3159_RESERVED, 0x0f}, /* from 0x00 to 0x0f for PCLK=80MHz */
/* HS, VS driving strength [3:2]=>VS, [1:0]=>HS 00:2mA, 01:4mA, 10:6mA,
 * 11:8mA
 */
	 {REG_315A_RESERVED, 0xf0}, /* from 0x10 to 0xf0 for PCLK=80MHz */
/* PCLK, DATA driving strength [7:6]=>data, [5:4]=>PCLK 00:2mA, 01:4mA
 * 10:6mA, 11:8mA
 */
/* AEC Setting */
	 {REG_ANALOGUE_GAIN_CODE_GLOBAL_MSB, 0x00},
	 {REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB, REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB_VALUE},
	 {REG_FINE_INTEGRATION_TIME, 0x02},
	 {REG_COARSE_INTEGRATION_TIME, 0x03},
/* Preview LC config Setting */
	 {REG_SH4CH_BLK_WIDTH_R, 0x52},
	 {REG_SH4CH_BLK_HEIGHT_R, 0x3e},
	 {REG_SH4CH_STEP_X_R_MSB, 0x03},
	 {REG_SH4CH_STEP_X_R_LSB, 0x1f},
	 {REG_SH4CH_STEP_Y_R_MSB, 0x04},
	 {REG_SH4CH_STEP_Y_R_LSB, 0x21},
	 {REG_SH4CH_START_BLK_CNT_X_R, 0x04},
	 {REG_SH4CH_START_BLK_INT_X_R, 0x00},
	 {REG_SH4CH_START_FRAC_X_R_MSB, 0x0c},
	 {REG_SH4CH_START_FRAC_X_R_LSB, 0x7c},
	 {REG_SH4CH_START_BLK_CNT_Y_R, 0x04},
	 {REG_SH4CH_START_BLK_INT_Y_R, 0x00},
	 {REG_SH4CH_START_FRAC_Y_R_MSB, 0x10},
	 {REG_SH4CH_START_FRAC_Y_R_LSB, 0x84},
	 },

/* EVT5 */
	{
	 {REG_PRE_PLL_CLK_DIV, 0x06}, /* PLL setting */
	 {REG_PLL_MULTIPLIER_MSB, 0x00},
	 {REG_PLL_MULTIPLIER_LSB, REG_PLL_MULTIPLIER_LSB_VALUE},
	 {REG_VT_PIX_CLK_DIV, 0x08},
	 {REG_VT_SYS_CLK_DIV, 0x01},
	 {REG_OP_PIX_CLK_DIV, 0x08},
	 {REG_OP_SYS_CLK_DIV, 0x01},
/* Data Format */
	 {REG_CCP_DATA_FORMAT_MSB, 0x0a},
	 {REG_CCP_DATA_FORMAT_LSB, 0x0a},
/* Preview Output Size */
	 {REG_X_OUTPUT_SIZE_MSB, 0x05},
	 {REG_X_OUTPUT_SIZE_LSB, 0x10},
	 {REG_Y_OUTPUT_SIZE_MSB, 0x03},
	 {REG_Y_OUTPUT_SIZE_LSB, 0xcc},
	 {REG_X_ADDR_START_MSB, 0x00},
	 {REG_X_ADDR_START_LSB, 0x08},
	 {REG_Y_ADDR_START_MSB, 0x00},
	 {REG_Y_ADDR_START_LSB, 0x08},
	 {REG_X_ADDR_END_MSB, 0x0a},
	 {REG_X_ADDR_END_LSB, 0x27},
	 {REG_Y_ADDR_END_MSB, 0x07},
	 {REG_Y_ADDR_END_LSB, 0x9f},
/* Frame format */
	 {REG_FRAME_LENGTH_LINES_MSB, 0x03},
	 {REG_FRAME_LENGTH_LINES_LSB, 0xe2},
	 {REG_LINE_LENGTH_PCK_MSB, 0x0a},
	 {REG_LINE_LENGTH_PCK_LSB, 0xac},
/* Preview Binning */
	 {REG_X_EVEN_INC, 0x01},
	 {REG_X_ODD_INC, 0x01},
	 {REG_Y_EVEN_INC, 0x01},
	 {REG_Y_ODD_INC, 0x03},
	 {REG_BINNING_ENABLE, 0x06},
/* Samsung MSR Setting */
	 {REG_SEL_CCP, 0x01},
	 {REG_LD_START, 0x03},
/* EVT5 sensor Samsung MSR setting */
	 {REG_LD_END, 0x99},
	 {REG_SL_START, 0x02},
	 {REG_SL_END, 0x9A},
	 {REG_RX_START, 0x0f},
	 {REG_S1_START, 0x05},
	 {REG_S1_END, 0x3c},
	 {REG_S1S_START, 0x8c},
	 {REG_S1S_END, 0x26},
	 {REG_S3_START, 0x05},
	 {REG_S3_END, 0x3a},
	 {REG_CMP_EN_START, 0x10},
	 {REG_CLP_SL_START, 0x02},
	 {REG_CLP_SL_END, 0x3e},
	 {REG_OFF_START, 0x02},
	 {REG_RMP_EN_START, 0x0e},
	 {REG_TX_START, 0x46},
	 {REG_TX_END, 0x64},
	 {REG_STX_WIDTH, 0x1e},
	 {REG_CLAMP_ON, 0x00},
	 {REG_301D_RESERVED, 0x3f},
	 {REG_VPIX, 0x04},
	 {REG_3028_RESERVED, 0x40},
	 {REG_3070_RESERVED, 0xdf},
	 {REG_3072_RESERVED, 0x20},
	 {REG_301B_RESERVED, 0x73},
	 {REG_OFFSET, 0x02},
	 {REG_30BD_RESERVED, 0x06},
	 {REG_30C2_RESERVED, 0x0b},
	 {REG_SHADE_CLK_ENABLE, 0x81},
	 {REG_3151_RESERVED, 0xe6},
	 {REG_3029_RESERVED, 0x02},
	 {REG_30BF_RESERVED, 0x00},
	 {REG_3022_RESERVED, 0x87},
	 {REG_3019_RESERVED, 0x60},
	 {0x3060, 0x03},
	 {0x3061, 0x6C},
	 {0x3062, 0x00},
	 {0x3063, 0xD6},
	 {0x3023, 0x0C},
	 {REG_3152_RESERVED, 0x08},
	 {REG_3150_RESERVED, 0x50}, /* from 0x40 to 0x50 for PCLK=80MHz */
/* Inverse PCLK = 0x50 */
	 {REG_3157_RESERVED, 0x04}, /* from 0x00 to 0x04 for PCLK=80MHz */
/* PCLK Delay offset; 0x0a will delay around 4ns at 80MHz */
	 {REG_3159_RESERVED, 0x0f}, /* from 0x00 to 0x0f for PCLK=80MHz */
/* HS, VS driving strength [3:2]=>VS, [1:0]=>HS 00:2mA, 01:4mA, 10:6mA,
 * 11:8mA
 */
	 {REG_315A_RESERVED, 0xf0}, /* from 0x10 to 0xf0 for PCLK=80MHz */
/* PCLK, DATA driving strength [7:6]=>data, [5:4]=>PCLK 00:2mA, 01:4mA,
 * 10:6mA, 11:8mA
 */
/* AEC Setting */
	 {REG_ANALOGUE_GAIN_CODE_GLOBAL_MSB, 0x00},
	 {REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB, REG_ANALOGUE_GAIN_CODE_GLOBAL_LSB_VALUE},
	 {REG_FINE_INTEGRATION_TIME, 0x02},
	 {REG_COARSE_INTEGRATION_TIME, 0x03},
/* Preview LC config Setting */
	 {REG_SH4CH_BLK_WIDTH_R, 0x52},
	 {REG_SH4CH_BLK_HEIGHT_R, 0x3e},
	 {REG_SH4CH_STEP_X_R_MSB, 0x03},
	 {REG_SH4CH_STEP_X_R_LSB, 0x1f},
	 {REG_SH4CH_STEP_Y_R_MSB, 0x04},
	 {REG_SH4CH_STEP_Y_R_LSB, 0x21},
	 {REG_SH4CH_START_BLK_CNT_X_R, 0x04},
	 {REG_SH4CH_START_BLK_INT_X_R, 0x00},
	 {REG_SH4CH_START_FRAC_X_R_MSB, 0x0c},
	 {REG_SH4CH_START_FRAC_X_R_LSB, 0x7c},
	 {REG_SH4CH_START_BLK_CNT_Y_R, 0x04},
	 {REG_SH4CH_START_BLK_INT_Y_R, 0x00},
	 {REG_SH4CH_START_FRAC_Y_R_MSB, 0x10},
	 {REG_SH4CH_START_FRAC_Y_R_LSB, 0x84},
	 }
};

struct s5k3e2fx_i2c_reg_conf lc_setting[2][NUM_LC_REG] = {
/*EVT4 */
	{
	/*EVT4 */  /* 100108 Modify LC setting DNP light source t75-r73*/
	{0x3200, 0x00},
	{0x3201, 0x99},
	{0x3202, 0xc1},
	{0x3203, 0x0f},
	{0x3204, 0xd0},
	{0x3205, 0x1b},
	{0x3206, 0x00},
	{0x3207, 0x24},
	{0x3208, 0x8d},
	{0x3209, 0x0f},
	{0x320a, 0xee},
	{0x320b, 0x0f},
	{0x320c, 0x00},
	{0x320d, 0x04},
	{0x320e, 0x5c},
	{0x320f, 0x00},
	{0x3210, 0x07},
	{0x3211, 0x68},
	{0x3212, 0x0f},
	{0x3213, 0xc2},
	{0x3214, 0x82},
	{0x3215, 0x00},
	{0x3216, 0x29},
	{0x3217, 0x3e},
	{0x3218, 0x0f},
	{0x3219, 0xd3},
	{0x321a, 0x63},
	{0x321b, 0x00},
	{0x321c, 0x22},
	{0x321d, 0x6c},
	{0x321e, 0x0f},
	{0x321f, 0xf8},
	{0x3220, 0xce},
	{0x3221, 0x0f},
	{0x3222, 0xed},
	{0x3223, 0x30},
	{0x3224, 0x00},
	{0x3225, 0x37},
	{0x3226, 0x87},
	{0x3227, 0x0f},
	{0x3228, 0xc2},
	{0x3229, 0x87},
	{0x322a, 0x00},
	{0x322b, 0x2a},
	{0x322c, 0xc6},
	{0x322d, 0x0f},
	{0x322e, 0xf3},
	{0x322f, 0xd9},
	{0x3230, 0x0f},
	{0x3231, 0xea},
	{0x3232, 0x1a},
	{0x3233, 0x00},
	{0x3234, 0x2d},
	{0x3235, 0x9f},
	{0x3236, 0x0f},
	{0x3237, 0xde},
	{0x3238, 0x7d},
	{0x3239, 0x00},
	{0x323a, 0x37},
	{0x323b, 0x1e},
	{0x323c, 0x0f},
	{0x323d, 0xed},
	{0x323e, 0x9c},
	{0x323f, 0x0f},
	{0x3240, 0xf6},
	{0x3241, 0xfd},
	{0x3242, 0x00},
	{0x3243, 0x15},
	{0x3244, 0xeb},
	{0x3245, 0x0f},
	{0x3246, 0xd3},
	{0x3247, 0xca},
	{0x3248, 0x00},
	{0x3249, 0x08},
	{0x324a, 0xe6},
	{0x324b, 0x0f},
	{0x324c, 0xf4},
	{0x324d, 0x7a},
	{0x324e, 0x0f},
	{0x324f, 0xed},
	{0x3250, 0x1e},
	{0x3251, 0x00},
	{0x3252, 0x0d},
	{0x3253, 0x46},
	{0x3254, 0x00},
	{0x3255, 0x0c},
	{0x3256, 0x3e},
	{0x3257, 0x00},
	{0x3258, 0x09},
	{0x3259, 0xcf},
	{0x325a, 0x00},
	{0x325b, 0x09},
	{0x325c, 0xb5},
	{0x325d, 0x0f},
	{0x325e, 0xec},
	{0x325f, 0x47},
	{0x3260, 0x00},
	{0x3261, 0x1d},
	{0x3262, 0xd8},
	{0x3263, 0x0f},
	{0x3264, 0xf7},
	{0x3265, 0x11},
	{0x3266, 0x0f},
	{0x3267, 0xea},
	{0x3268, 0x3d},
	{0x3269, 0x00},
	{0x326a, 0x09},
	{0x326b, 0xcc},
	{0x326c, 0x00},
	{0x326d, 0x9b},
	{0x326e, 0x73},
	{0x326f, 0x0f},
	{0x3270, 0xd4},
	{0x3271, 0x9e},
	{0x3272, 0x00},
	{0x3273, 0x1a},
	{0x3274, 0x87},
	{0x3275, 0x0f},
	{0x3276, 0xfd},
	{0x3277, 0xeb},
	{0x3278, 0x0f},
	{0x3279, 0xf5},
	{0x327a, 0xb4},
	{0x327b, 0x00},
	{0x327c, 0x0d},
	{0x327d, 0x8c},
	{0x327e, 0x0f},
	{0x327f, 0xc9},
	{0x3280, 0x4d},
	{0x3281, 0x00},
	{0x3282, 0x1d},
	{0x3283, 0x2d},
	{0x3284, 0x0f},
	{0x3285, 0xea},
	{0x3286, 0x5b},
	{0x3287, 0x00},
	{0x3288, 0x04},
	{0x3289, 0x76},
	{0x328a, 0x00},
	{0x328b, 0x10},
	{0x328c, 0x2d},
	{0x328d, 0x0f},
	{0x328e, 0xe6},
	{0x328f, 0xde},
	{0x3290, 0x00},
	{0x3291, 0x26},
	{0x3292, 0x85},
	{0x3293, 0x0f},
	{0x3294, 0xcf},
	{0x3295, 0x12},
	{0x3296, 0x00},
	{0x3297, 0x14},
	{0x3298, 0x0f},
	{0x3299, 0x00},
	{0x329a, 0x0b},
	{0x329b, 0x36},
	{0x329c, 0x0f},
	{0x329d, 0xe4},
	{0x329e, 0xa4},
	{0x329f, 0x00},
	{0x32a0, 0x21},
	{0x32a1, 0x1f},
	{0x32a2, 0x0f},
	{0x32a3, 0xf3},
	{0x32a4, 0x99},
	{0x32a5, 0x00},
	{0x32a6, 0x30},
	{0x32a7, 0x8f},
	{0x32a8, 0x0f},
	{0x32a9, 0xf9},
	{0x32aa, 0x35},
	{0x32ab, 0x0f},
	{0x32ac, 0xee},
	{0x32ad, 0x6e},
	{0x32ae, 0x00},
	{0x32af, 0x09},
	{0x32b0, 0x19},
	{0x32b1, 0x0f},
	{0x32b2, 0xf0},
	{0x32b3, 0x57},
	{0x32b4, 0x00},
	{0x32b5, 0x01},
	{0x32b6, 0xcc},
	{0x32b7, 0x0f},
	{0x32b8, 0xf1},
	{0x32b9, 0x0b},
	{0x32ba, 0x0f},
	{0x32bb, 0xee},
	{0x32bc, 0x99},
	{0x32bd, 0x00},
	{0x32be, 0x11},
	{0x32bf, 0x3d},
	{0x32c0, 0x00},
	{0x32c1, 0x10},
	{0x32c2, 0x64},
	{0x32c3, 0x0f},
	{0x32c4, 0xf6},
	{0x32c5, 0xab},
	{0x32c6, 0x00},
	{0x32c7, 0x03},
	{0x32c8, 0x19},
	{0x32c9, 0x0f},
	{0x32ca, 0xf3},
	{0x32cb, 0xc9},
	{0x32cc, 0x00},
	{0x32cd, 0x17},
	{0x32ce, 0xb3},
	{0x32cf, 0x0f},
	{0x32d0, 0xf2},
	{0x32d1, 0x3d},
	{0x32d2, 0x0f},
	{0x32d3, 0xf4},
	{0x32d4, 0x7e},
	{0x32d5, 0x00},
	{0x32d6, 0x09},
	{0x32d7, 0x46},
	{0x32d8, 0x00},
	{0x32d9, 0x7c},
	{0x32da, 0x79},
	{0x32db, 0x0f},
	{0x32dc, 0xde},
	{0x32dd, 0x19},
	{0x32de, 0x00},
	{0x32df, 0x19},
	{0x32e0, 0xe8},
	{0x32e1, 0x0f},
	{0x32e2, 0xf3},
	{0x32e3, 0x41},
	{0x32e4, 0x00},
	{0x32e5, 0x03},
	{0x32e6, 0x4c},
	{0x32e7, 0x00},
	{0x32e8, 0x05},
	{0x32e9, 0x73},
	{0x32ea, 0x0f},
	{0x32eb, 0xd6},
	{0x32ec, 0xa5},
	{0x32ed, 0x00},
	{0x32ee, 0x1f},
	{0x32ef, 0x81},
	{0x32f0, 0x0f},
	{0x32f1, 0xdc},
	{0x32f2, 0xe6},
	{0x32f3, 0x00},
	{0x32f4, 0x18},
	{0x32f5, 0x65},
	{0x32f6, 0x00},
	{0x32f7, 0x00},
	{0x32f8, 0x11},
	{0x32f9, 0x0f},
	{0x32fa, 0xed},
	{0x32fb, 0x65},
	{0x32fc, 0x00},
	{0x32fd, 0x23},
	{0x32fe, 0x12},
	{0x32ff, 0x0f},
	{0x3300, 0xcf},
	{0x3301, 0x28},
	{0x3302, 0x00},
	{0x3303, 0x2b},
	{0x3304, 0xda},
	{0x3305, 0x0f},
	{0x3306, 0xef},
	{0x3307, 0xae},
	{0x3308, 0x0f},
	{0x3309, 0xeb},
	{0x330a, 0x13},
	{0x330b, 0x00},
	{0x330c, 0x27},
	{0x330d, 0xb8},
	{0x330e, 0x0f},
	{0x330f, 0xec},
	{0x3310, 0x69},
	{0x3311, 0x00},
	{0x3312, 0x2f},
	{0x3313, 0x5f},
	{0x3314, 0x0f},
	{0x3315, 0xdf},
	{0x3316, 0x4f},
	{0x3317, 0x00},
	{0x3318, 0x05},
	{0x3319, 0x70},
	{0x331a, 0x00},
	{0x331b, 0x0f},
	{0x331c, 0xd2},
	{0x331d, 0x0f},
	{0x331e, 0xe1},
	{0x331f, 0xd8},
	{0x3320, 0x00},
	{0x3321, 0x09},
	{0x3322, 0xcf},
	{0x3323, 0x0f},
	{0x3324, 0xf2},
	{0x3325, 0x6e},
	{0x3326, 0x0f},
	{0x3327, 0xf6},
	{0x3328, 0xb4},
	{0x3329, 0x00},
	{0x332a, 0x0d},
	{0x332b, 0x87},
	{0x332c, 0x00},
	{0x332d, 0x08},
	{0x332e, 0x1e},
	{0x332f, 0x0f},
	{0x3330, 0xfa},
	{0x3331, 0x6e},
	{0x3332, 0x0f},
	{0x3333, 0xff},
	{0x3334, 0xaa},
	{0x3335, 0x0f},
	{0x3336, 0xf2},
	{0x3337, 0xc0},
	{0x3338, 0x00},
	{0x3339, 0x1d},
	{0x333a, 0x18},
	{0x333b, 0x0f},
	{0x333c, 0xef},
	{0x333d, 0xed},
	{0x333e, 0x0f},
	{0x333f, 0xec},
	{0x3340, 0xf6},
	{0x3341, 0x00},
	{0x3342, 0x16},
	{0x3343, 0x8e},
	{0x3344, 0x00},
	{0x3345, 0x9c},
	{0x3346, 0x52},
	{0x3347, 0x0f},
	{0x3348, 0xcf},
	{0x3349, 0xb9},
	{0x334a, 0x00},
	{0x334b, 0x29},
	{0x334c, 0xe9},
	{0x334d, 0x0f},
	{0x334e, 0xe2},
	{0x334f, 0x83},
	{0x3350, 0x00},
	{0x3351, 0x11},
	{0x3352, 0xcc},
	{0x3353, 0x0f},
	{0x3354, 0xff},
	{0x3355, 0xf4},
	{0x3356, 0x0f},
	{0x3357, 0xc1},
	{0x3358, 0xa4},
	{0x3359, 0x00},
	{0x335a, 0x2f},
	{0x335b, 0xce},
	{0x335c, 0x0f},
	{0x335d, 0xc5},
	{0x335e, 0xbb},
	{0x335f, 0x00},
	{0x3360, 0x35},
	{0x3361, 0x2a},
	{0x3362, 0x0f},
	{0x3363, 0xe6},
	{0x3364, 0x2a},
	{0x3365, 0x0f},
	{0x3366, 0xf7},
	{0x3367, 0x44},
	{0x3368, 0x00},
	{0x3369, 0x31},
	{0x336a, 0xfe},
	{0x336b, 0x0f},
	{0x336c, 0xb6},
	{0x336d, 0x84},
	{0x336e, 0x00},
	{0x336f, 0x3c},
	{0x3370, 0x71},
	{0x3371, 0x0f},
	{0x3372, 0xe5},
	{0x3373, 0xfe},
	{0x3374, 0x0f},
	{0x3375, 0xf2},
	{0x3376, 0x87},
	{0x3377, 0x00},
	{0x3378, 0x29},
	{0x3379, 0x2b},
	{0x337a, 0x0f},
	{0x337b, 0xe5},
	{0x337c, 0x3f},
	{0x337d, 0x00},
	{0x337e, 0x45},
	{0x337f, 0xc6},
	{0x3380, 0x0f},
	{0x3381, 0xdf},
	{0x3382, 0xe6},
	{0x3383, 0x0f},
	{0x3384, 0xfb},
	{0x3385, 0x0f},
	{0x3386, 0x00},
	{0x3387, 0x0f},
	{0x3388, 0xf4},
	{0x3389, 0x0f},
	{0x338a, 0xdf},
	{0x338b, 0x72},
	{0x338c, 0x00},
	{0x338d, 0x0e},
	{0x338e, 0xaf},
	{0x338f, 0x0f},
	{0x3390, 0xed},
	{0x3391, 0x7a},
	{0x3392, 0x0f},
	{0x3393, 0xe5},
	{0x3394, 0xab},
	{0x3395, 0x00},
	{0x3396, 0x18},
	{0x3397, 0x43},
	{0x3398, 0x00},
	{0x3399, 0x1b},
	{0x339a, 0x41},
	{0x339b, 0x0f},
	{0x339c, 0xea},
	{0x339d, 0x84},
	{0x339e, 0x0f},
	{0x339f, 0xfd},
	{0x33a0, 0xdb},
	{0x33a1, 0x0f},
	{0x33a2, 0xe9},
	{0x33a3, 0xbd},
	{0x33a4, 0x00},
	{0x33a5, 0x30},
	{0x33a6, 0x77},
	{0x33a7, 0x0f},
	{0x33a8, 0xe9},
	{0x33a9, 0x93},
	{0x33aa, 0x0f},
	{0x33ab, 0xd7},
	{0x33ac, 0xde},
	{0x33ad, 0x00},
	{0x33ae, 0x2a},
	{0x33af, 0x14},
	{0x309D, 0x62},
	{0x309d, 0x22},

/* LC setting End */
	 },
/*EVT5 */
	{
/* LC setting Start */
	 {0x3200, 0x00}, /* 100108 Modify LC setting DNP light source t75-r73*/
	 {0x3201, 0x99},
	 {0x3202, 0xc1},
	 {0x3203, 0x0f},
	 {0x3204, 0xd0},
	 {0x3205, 0x1b},
	 {0x3206, 0x00},
	 {0x3207, 0x24},
	 {0x3208, 0x8d},
	 {0x3209, 0x0f},
	 {0x320a, 0xee},
	 {0x320b, 0x0f},
	 {0x320c, 0x00},
	 {0x320d, 0x04},
	 {0x320e, 0x5c},
	 {0x320f, 0x00},
	 {0x3210, 0x07},
	 {0x3211, 0x68},
	 {0x3212, 0x0f},
	 {0x3213, 0xc2},
	 {0x3214, 0x82},
	 {0x3215, 0x00},
	 {0x3216, 0x29},
	 {0x3217, 0x3e},
	 {0x3218, 0x0f},
	 {0x3219, 0xd3},
	 {0x321a, 0x63},
	 {0x321b, 0x00},
	 {0x321c, 0x22},
	 {0x321d, 0x6c},
	 {0x321e, 0x0f},
	 {0x321f, 0xf8},
	 {0x3220, 0xce},
	 {0x3221, 0x0f},
	 {0x3222, 0xed},
	 {0x3223, 0x30},
	 {0x3224, 0x00},
	 {0x3225, 0x37},
	 {0x3226, 0x87},
	 {0x3227, 0x0f},
	 {0x3228, 0xc2},
	 {0x3229, 0x87},
	 {0x322a, 0x00},
	 {0x322b, 0x2a},
	 {0x322c, 0xc6},
	 {0x322d, 0x0f},
	 {0x322e, 0xf3},
	 {0x322f, 0xd9},
	 {0x3230, 0x0f},
	 {0x3231, 0xea},
	 {0x3232, 0x1a},
	 {0x3233, 0x00},
	 {0x3234, 0x2d},
	 {0x3235, 0x9f},
	 {0x3236, 0x0f},
	 {0x3237, 0xde},
	 {0x3238, 0x7d},
	 {0x3239, 0x00},
	 {0x323a, 0x37},
	 {0x323b, 0x1e},
	 {0x323c, 0x0f},
	 {0x323d, 0xed},
	 {0x323e, 0x9c},
	 {0x323f, 0x0f},
	 {0x3240, 0xf6},
	 {0x3241, 0xfd},
	 {0x3242, 0x00},
	 {0x3243, 0x15},
	 {0x3244, 0xeb},
	 {0x3245, 0x0f},
	 {0x3246, 0xd3},
	 {0x3247, 0xca},
	 {0x3248, 0x00},
	 {0x3249, 0x08},
	 {0x324a, 0xe6},
	 {0x324b, 0x0f},
	 {0x324c, 0xf4},
	 {0x324d, 0x7a},
	 {0x324e, 0x0f},
	 {0x324f, 0xed},
	 {0x3250, 0x1e},
	 {0x3251, 0x00},
	 {0x3252, 0x0d},
	 {0x3253, 0x46},
	 {0x3254, 0x00},
	 {0x3255, 0x0c},
	 {0x3256, 0x3e},
	 {0x3257, 0x00},
	 {0x3258, 0x09},
	 {0x3259, 0xcf},
	 {0x325a, 0x00},
	 {0x325b, 0x09},
	 {0x325c, 0xb5},
	 {0x325d, 0x0f},
	 {0x325e, 0xec},
	 {0x325f, 0x47},
	 {0x3260, 0x00},
	 {0x3261, 0x1d},
	 {0x3262, 0xd8},
	 {0x3263, 0x0f},
	 {0x3264, 0xf7},
	 {0x3265, 0x11},
	 {0x3266, 0x0f},
	 {0x3267, 0xea},
	 {0x3268, 0x3d},
	 {0x3269, 0x00},
	 {0x326a, 0x09},
	 {0x326b, 0xcc},
	 {0x326c, 0x00},
	 {0x326d, 0x99},
	 {0x326e, 0x45},
	 {0x326f, 0x0f},
	 {0x3270, 0xd3},
	 {0x3271, 0x80},
	 {0x3272, 0x00},
	 {0x3273, 0x20},
	 {0x3274, 0xf7},
	 {0x3275, 0x0f},
	 {0x3276, 0xef},
	 {0x3277, 0x0d},
	 {0x3278, 0x00},
	 {0x3279, 0x09},
	 {0x327a, 0x3c},
	 {0x327b, 0x00},
	 {0x327c, 0x01},
	 {0x327d, 0x16},
	 {0x327e, 0x0f},
	 {0x327f, 0xc9},
	 {0x3280, 0x36},
	 {0x3281, 0x00},
	 {0x3282, 0x21},
	 {0x3283, 0xff},
	 {0x3284, 0x0f},
	 {0x3285, 0xdc},
	 {0x3286, 0xc2},
	 {0x3287, 0x00},
	 {0x3288, 0x1e},
	 {0x3289, 0xc0},
	 {0x328a, 0x0f},
	 {0x328b, 0xf0},
	 {0x328c, 0xa7},
	 {0x328d, 0x0f},
	 {0x328e, 0xf9},
	 {0x328f, 0x2a},
	 {0x3290, 0x00},
	 {0x3291, 0x29},
	 {0x3292, 0x5c},
	 {0x3293, 0x0f},
	 {0x3294, 0xc9},
	 {0x3295, 0x2a},
	 {0x3296, 0x00},
	 {0x3297, 0x1f},
	 {0x3298, 0x5c},
	 {0x3299, 0x0f},
	 {0x329a, 0xfa},
	 {0x329b, 0x0c},
	 {0x329c, 0x0f},
	 {0x329d, 0xf3},
	 {0x329e, 0x94},
	 {0x329f, 0x00},
	 {0x32a0, 0x1c},
	 {0x32a1, 0xce},
	 {0x32a2, 0x0f},
	 {0x32a3, 0xed},
	 {0x32a4, 0xb7},
	 {0x32a5, 0x00},
	 {0x32a6, 0x34},
	 {0x32a7, 0x51},
	 {0x32a8, 0x0f},
	 {0x32a9, 0xfa},
	 {0x32aa, 0x7d},
	 {0x32ab, 0x0f},
	 {0x32ac, 0xe6},
	 {0x32ad, 0xbf},
	 {0x32ae, 0x00},
	 {0x32af, 0x18},
	 {0x32b0, 0xc6},
	 {0x32b1, 0x0f},
	 {0x32b2, 0xe0},
	 {0x32b3, 0x72},
	 {0x32b4, 0x00},
	 {0x32b5, 0x08},
	 {0x32b6, 0x23},
	 {0x32b7, 0x0f},
	 {0x32b8, 0xf1},
	 {0x32b9, 0x54},
	 {0x32ba, 0x0f},
	 {0x32bb, 0xe1},
	 {0x32bc, 0x84},
	 {0x32bd, 0x00},
	 {0x32be, 0x26},
	 {0x32bf, 0xb1},
	 {0x32c0, 0x0f},
	 {0x32c1, 0xfa},
	 {0x32c2, 0xc2},
	 {0x32c3, 0x00},
	 {0x32c4, 0x05},
	 {0x32c5, 0x3d},
	 {0x32c6, 0x0f},
	 {0x32c7, 0xff},
	 {0x32c8, 0xaf},
	 {0x32c9, 0x0f},
	 {0x32ca, 0xf1},
	 {0x32cb, 0xe5},
	 {0x32cc, 0x00},
	 {0x32cd, 0x21},
	 {0x32ce, 0xdd},
	 {0x32cf, 0x0f},
	 {0x32d0, 0xe8},
	 {0x32d1, 0x6a},
	 {0x32d2, 0x0f},
	 {0x32d3, 0xf4},
	 {0x32d4, 0xfb},
	 {0x32d5, 0x00},
	 {0x32d6, 0x0c},
	 {0x32d7, 0x89},
	 {0x32d8, 0x00},
	 {0x32d9, 0x7c},
	 {0x32da, 0x79},
	 {0x32db, 0x0f},
	 {0x32dc, 0xde},
	 {0x32dd, 0x19},
	 {0x32de, 0x00},
	 {0x32df, 0x19},
	 {0x32e0, 0xe8},
	 {0x32e1, 0x0f},
	 {0x32e2, 0xf3},
	 {0x32e3, 0x41},
	 {0x32e4, 0x00},
	 {0x32e5, 0x03},
	 {0x32e6, 0x4c},
	 {0x32e7, 0x00},
	 {0x32e8, 0x05},
	 {0x32e9, 0x73},
	 {0x32ea, 0x0f},
	 {0x32eb, 0xd6},
	 {0x32ec, 0xa5},
	 {0x32ed, 0x00},
	 {0x32ee, 0x1f},
	 {0x32ef, 0x81},
	 {0x32f0, 0x0f},
	 {0x32f1, 0xdc},
	 {0x32f2, 0xe6},
	 {0x32f3, 0x00},
	 {0x32f4, 0x18},
	 {0x32f5, 0x65},
	 {0x32f6, 0x00},
	 {0x32f7, 0x00},
	 {0x32f8, 0x11},
	 {0x32f9, 0x0f},
	 {0x32fa, 0xed},
	 {0x32fb, 0x65},
	 {0x32fc, 0x00},
	 {0x32fd, 0x23},
	 {0x32fe, 0x12},
	 {0x32ff, 0x0f},
	 {0x3300, 0xcf},
	 {0x3301, 0x28},
	 {0x3302, 0x00},
	 {0x3303, 0x2b},
	 {0x3304, 0xda},
	 {0x3305, 0x0f},
	 {0x3306, 0xef},
	 {0x3307, 0xae},
	 {0x3308, 0x0f},
	 {0x3309, 0xeb},
	 {0x330a, 0x13},
	 {0x330b, 0x00},
	 {0x330c, 0x27},
	 {0x330d, 0xb8},
	 {0x330e, 0x0f},
	 {0x330f, 0xec},
	 {0x3310, 0x69},
	 {0x3311, 0x00},
	 {0x3312, 0x2f},
	 {0x3313, 0x5f},
	 {0x3314, 0x0f},
	 {0x3315, 0xdf},
	 {0x3316, 0x4f},
	 {0x3317, 0x00},
	 {0x3318, 0x05},
	 {0x3319, 0x70},
	 {0x331a, 0x00},
	 {0x331b, 0x0f},
	 {0x331c, 0xd2},
	 {0x331d, 0x0f},
	 {0x331e, 0xe1},
	 {0x331f, 0xd8},
	 {0x3320, 0x00},
	 {0x3321, 0x09},
	 {0x3322, 0xcf},
	 {0x3323, 0x0f},
	 {0x3324, 0xf2},
	 {0x3325, 0x6e},
	 {0x3326, 0x0f},
	 {0x3327, 0xf6},
	 {0x3328, 0xb4},
	 {0x3329, 0x00},
	 {0x332a, 0x0d},
	 {0x332b, 0x87},
	 {0x332c, 0x00},
	 {0x332d, 0x08},
	 {0x332e, 0x1e},
	 {0x332f, 0x0f},
	 {0x3330, 0xfa},
	 {0x3331, 0x6e},
	 {0x3332, 0x0f},
	 {0x3333, 0xff},
	 {0x3334, 0xaa},
	 {0x3335, 0x0f},
	 {0x3336, 0xf2},
	 {0x3337, 0xc0},
	 {0x3338, 0x00},
	 {0x3339, 0x1d},
	 {0x333a, 0x18},
	 {0x333b, 0x0f},
	 {0x333c, 0xef},
	 {0x333d, 0xed},
	 {0x333e, 0x0f},
	 {0x333f, 0xec},
	 {0x3340, 0xf6},
	 {0x3341, 0x00},
	 {0x3342, 0x16},
	 {0x3343, 0x8e},
	 {0x3344, 0x00},
	 {0x3345, 0x9c},
	 {0x3346, 0x52},
	 {0x3347, 0x0f},
	 {0x3348, 0xcf},
	 {0x3349, 0xb9},
	 {0x334a, 0x00},
	 {0x334b, 0x29},
	 {0x334c, 0xe9},
	 {0x334d, 0x0f},
	 {0x334e, 0xe2},
	 {0x334f, 0x83},
	 {0x3350, 0x00},
	 {0x3351, 0x11},
	 {0x3352, 0xcc},
	 {0x3353, 0x0f},
	 {0x3354, 0xff},
	 {0x3355, 0xf4},
	 {0x3356, 0x0f},
	 {0x3357, 0xc1},
	 {0x3358, 0xa4},
	 {0x3359, 0x00},
	 {0x335a, 0x2f},
	 {0x335b, 0xce},
	 {0x335c, 0x0f},
	 {0x335d, 0xc5},
	 {0x335e, 0xbb},
	 {0x335f, 0x00},
	 {0x3360, 0x35},
	 {0x3361, 0x2a},
	 {0x3362, 0x0f},
	 {0x3363, 0xe6},
	 {0x3364, 0x2a},
	 {0x3365, 0x0f},
	 {0x3366, 0xf7},
	 {0x3367, 0x44},
	 {0x3368, 0x00},
	 {0x3369, 0x31},
	 {0x336a, 0xfe},
	 {0x336b, 0x0f},
	 {0x336c, 0xb6},
	 {0x336d, 0x84},
	 {0x336e, 0x00},
	 {0x336f, 0x3c},
	 {0x3370, 0x71},
	 {0x3371, 0x0f},
	 {0x3372, 0xe5},
	 {0x3373, 0xfe},
	 {0x3374, 0x0f},
	 {0x3375, 0xf2},
	 {0x3376, 0x87},
	 {0x3377, 0x00},
	 {0x3378, 0x29},
	 {0x3379, 0x2b},
	 {0x337a, 0x0f},
	 {0x337b, 0xe5},
	 {0x337c, 0x3f},
	 {0x337d, 0x00},
	 {0x337e, 0x45},
	 {0x337f, 0xc6},
	 {0x3380, 0x0f},
	 {0x3381, 0xdf},
	 {0x3382, 0xe6},
	 {0x3383, 0x0f},
	 {0x3384, 0xfb},
	 {0x3385, 0x0f},
	 {0x3386, 0x00},
	 {0x3387, 0x0f},
	 {0x3388, 0xf4},
	 {0x3389, 0x0f},
	 {0x338a, 0xdf},
	 {0x338b, 0x72},
	 {0x338c, 0x00},
	 {0x338d, 0x0e},
	 {0x338e, 0xaf},
	 {0x338f, 0x0f},
	 {0x3390, 0xed},
	 {0x3391, 0x7a},
	 {0x3392, 0x0f},
	 {0x3393, 0xe5},
	 {0x3394, 0xab},
	 {0x3395, 0x00},
	 {0x3396, 0x18},
	 {0x3397, 0x43},
	 {0x3398, 0x00},
	 {0x3399, 0x1b},
	 {0x339a, 0x41},
	 {0x339b, 0x0f},
	 {0x339c, 0xea},
	 {0x339d, 0x84},
	 {0x339e, 0x0f},
	 {0x339f, 0xfd},
	 {0x33a0, 0xdb},
	 {0x33a1, 0x0f},
	 {0x33a2, 0xe9},
	 {0x33a3, 0xbd},
	 {0x33a4, 0x00},
	 {0x33a5, 0x30},
	 {0x33a6, 0x77},
	 {0x33a7, 0x0f},
	 {0x33a8, 0xe9},
	 {0x33a9, 0x93},
	 {0x33aa, 0x0f},
	 {0x33ab, 0xd7},
	 {0x33ac, 0xde},
	 {0x33ad, 0x00},
	 {0x33ae, 0x2a},
	 {0x33af, 0x14},
	 {0x309D, 0x62},
	 {0x309d, 0x22}, /* shading enable */
	 /*LC setting End */
	 }
}; /* lc_setting} */

static struct wake_lock s5k3e2fx_wake_lock;

static inline void init_suspend(void)
{
	wake_lock_init(&s5k3e2fx_wake_lock, WAKE_LOCK_IDLE, "s5k3e2fx");
}

static inline void deinit_suspend(void)
{
	wake_lock_destroy(&s5k3e2fx_wake_lock);
}

static inline void prevent_suspend(void)
{
	wake_lock(&s5k3e2fx_wake_lock);
}

static inline void allow_suspend(void)
{
	wake_unlock(&s5k3e2fx_wake_lock);
}

struct reg_struct {
/* PLL setting */
	uint8_t pre_pll_clk_div;	/* 0x0305 */
	uint8_t pll_multiplier_msb;	/* 0x0306 */
	uint8_t pll_multiplier_lsb;	/* 0x0307 */
	uint8_t vt_pix_clk_div;	/* 0x0301 */
	uint8_t vt_sys_clk_div;	/* 0x0303 */
	uint8_t op_pix_clk_div;	/* 0x0309 */
	uint8_t op_sys_clk_div;	/* 0x030B */
/* Data Format */
	uint8_t ccp_data_format_msb;	/* 0x0112 */
	uint8_t ccp_data_format_lsb;	/* 0x0113 */
/* Preview Output Size */
	uint8_t x_output_size_msb;	/* 0x034C */
	uint8_t x_output_size_lsb;	/* 0x034D */
	uint8_t y_output_size_msb;	/* 0x034E */
	uint8_t y_output_size_lsb;	/* 0x034F */
/* add the X-Y addr setting position */
	uint8_t x_addr_start_MSB;	/* 0x0344 */
	uint8_t x_addr_start_LSB;	/* 0x0345 */
	uint8_t y_addr_start_MSB;	/* 0x0346 */
	uint8_t y_addr_start_LSB;	/* 0x0347 */
	uint8_t x_addr_end_MSB;	/* 0x0348 */
	uint8_t x_addr_end_LSB;	/* 0x0349 */
	uint8_t y_addr_end_MSB;	/* 0x034A */
	uint8_t y_addr_end_LSB;	/* 0x034B */
/* change the setting position */
/* Frame format */
	uint8_t frame_length_lines_msb;	/* 0x0340 */
	uint8_t frame_length_lines_lsb;	/* 0x0341 */
	uint8_t line_length_pck_msb;	/* 0x0342 */
	uint8_t line_length_pck_lsb;	/* 0x0343 */
/* binning */
	uint8_t x_even_inc;	/* 0x0381 */
	uint8_t x_odd_inc;	/* 0x0383 */
	uint8_t y_even_inc;	/* 0x0385 */
	uint8_t y_odd_inc;	/* 0x0387 */
	uint8_t binning_enable;	/* 0x3014 */
/* Samsung MSR Setting */
	uint8_t sel_ccp;	/* 0x30C4 */
	uint8_t ld_start;	/* 0x3000 */
	uint8_t ld_end;		/* 0x3001 */
	uint8_t sl_start;	/* 0x3002 */
	uint8_t sl_end;		/* 0x3003 */
	uint8_t rx_start;	/* 0x3004 */
	uint8_t s1_start;	/* 0x3005 */
	uint8_t s1_end;		/* 0x3006 */
	uint8_t s1s_start;	/* 0x3007 */
	uint8_t s1s_end;	/* 0x3008 */
	uint8_t s3_start;	/* 0x3009 */
	uint8_t s3_end;		/* 0x300A */
	uint8_t cmp_en_start;	/* 0x300B */
	uint8_t clp_sl_start;	/* 0x300C */
	uint8_t clp_sl_end;	/* 0x300D */
	uint8_t off_start;	/* 0x300E */
	uint8_t rmp_en_start;	/* 0x300F */
	uint8_t tx_start;	/* 0x3010 */
	uint8_t tx_end;		/* 0x3011 */
	uint8_t stx_width;	/* 0x3012 */
/* Samsung other MSR setting */
	uint8_t clamp_on;	/* 0x3015 */
	uint8_t reg_301d_reserved;	/* 0x301D */
	uint8_t vpix;		/* 0x3024 */
	uint8_t reg_3028_reserved;	/* 0x3028 */
	uint8_t reg_3070_reserved;	/* 0x3070 */
	uint8_t reg_3072_reserved;	/* 0x3072 */
	uint8_t reg_301b_reserved;	/* 0x301B */
	uint8_t offset;		/* 0x307E */
	uint8_t reg_30bd_reserved;	/* 0x30BD */
	uint8_t reg_30c2_reserved;	/* 0x30C2 */
	uint8_t shade_clk_enable;	/* 0x30AC */
	uint8_t reg_3051_reserved;	/* 0x3051 */
	uint8_t reg_3029_reserved;	/* 0x3029 */
	uint8_t reg_30bf_reserved;	/* 0x30BF */
	uint8_t reg_3022_reserved;	/* 0x3022 */
	uint8_t reg_3019_reserved;	/* 0x3019 */
/* end: Samsung other MSR setting */
	uint8_t reg_3152_reserved;	/* 0x3152 */
/* Samsung signal output setting */
	uint8_t reg_3150_reserved;	/* 0x3150 */
	uint8_t reg_3157_reserved;	/* 0x3157 */
	uint8_t reg_3159_reserved;	/* 0x3159 */
/* end: Samsung signal output setting */
	uint8_t reg_315A_reserved;	/* 0x315A */
/* AEC Setting */
	uint8_t analogue_gain_code_global_msb;	/* 0x0204 */
	uint8_t analogue_gain_code_global_lsb;	/* 0x0205 */
	uint8_t fine_integration_time;	/* 0x0200 */
	uint8_t coarse_integration_time;	/* 0x0202 */
/* LC Preview/Snapshot difference register */
/* Preview LC Setting */
	uint8_t sh4ch_blk_width_r;	/* 0x309E */
	uint8_t sh4ch_blk_height_r;	/* 0x309F */
	uint8_t sh4ch_step_x_r_MSB;	/* 0x30A0 */
	uint8_t sh4ch_step_x_r_LSB;	/* 0x30A1 */
	uint8_t sh4ch_step_y_r_MSB;	/* 0x30A2 */
	uint8_t sh4ch_step_y_r_LSB;	/* 0x30A3 */
	uint8_t sh4ch_start_blk_cnt_x_r;	/* 0x30A4 */
	uint8_t sh4ch_start_blk_int_x_r;	/* 0x30A5 */
	uint8_t sh4ch_start_frac_x_r_MSB;	/* 0x30A6 */
	uint8_t sh4ch_start_frac_x_r_LSB;	/* 0x30A7 */
	uint8_t sh4ch_start_blk_cnt_y_r;	/* 0x30A8 */
	uint8_t sh4ch_start_blk_int_y_r;	/* 0x30A9 */
	uint8_t sh4ch_start_frac_y_r_MSB;	/* 0x30AA */
	uint8_t sh4ch_start_frac_y_r_LSB;	/* 0x30AB */
/* end: LC Preview/Snapshot difference register */
	uint32_t size_h;
	uint32_t blk_l;
	uint32_t size_w;
	uint32_t blk_p;
};

struct reg_struct s5k3e2fx_reg_pat[2] = {
	{			/* Preview */
/* PLL setting */
	 0x06,			/* pre_pll_clk_div               REG=0x0305 */
	 0x00,			/* pll_multiplier_msb            REG=0x0306 */
	 REG_PLL_MULTIPLIER_LSB_VALUE,
				/* pll_multiplier_lsb            REG=0x0307 */
	 0x08,			/* vt_pix_clk_div                REG=0x0301 */
	 0x01,			/* vt_sys_clk_div                REG=0x0303 */
	 0x08,			/* op_pix_clk_div                REG=0x0309 */
	 0x01,			/* op_sys_clk_div                REG=0x030B */
/* Data Format */
	 0x0a,			/* ccp_data_format_msb   REG=0x0112 */
	 0x0a,			/* ccp_data_format_lsb   REG=0x0113 */
/* Preview Output Size */
	 0x05,			/* x_output_size_msb     REG=0x034C */
	 0x10,			/* x_output_size_lsb     REG=0x034D */
	 0x03,			/* y_output_size_msb     REG=0x034E */
